cf_billing/InformationRegisters/энргДоступныеРайоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДоступныеРайоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/макрКодыМакросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>макрКодыМакросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсполняемыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Макрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.макрМакросы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргРолиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРолиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтатусСогласованияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтатусСогласованияСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыСогласованияСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСобытие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтатусВыполненияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтатусВыполненияСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Указывает выполнено ли событие или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСобытие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФормаУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФормыУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>энргНаименованиеОперацииОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестКодОрганизацииВнутриГоловнойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестРежимРаботыОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестДатаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращённое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/Банки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Банки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеИзменение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/макрПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>макрПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.макрОбъектыКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрикрепленногоФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.макрВидыПрикрепленныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСтроений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/CommonModules/энргОбщегоНазначения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Устанавливает параметры сеансов.
//
// Параметры:
//  ИмяПараметра			-	Строка.
//  УстановленныеПараметры	-	Массив из Строка.
//
Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	Если ИмяПараметра = "энргДоступныеРайоны" Тогда
		
		УстановленныеПараметры.Добавить("энргДоступныеРайоны");
		
		ПараметрыСеанса.энргДоступныеРайоны = ДоступныеРайоны(Пользователи.ТекущийПользователь());
		
	КонецЕсли;
КонецПроцедуры

// Возвращает контрольную сумму.
//
// Параметры:
//  ОписаниеПараметров	-	Структура.
// 
// Возвращаемое значение:
//   Число.
//
Функция КонтрольнаяСумма(ОписаниеПараметров) Экспорт 
	Хэш = Новый ХешированиеДанных(ХешФункция.CRC32);
	Хэш.Добавить(ЗначениеВСтрокуВнутр(ОписаниеПараметров));
	Возврат Хэш.ХешСумма;
КонецФункции

// Возвращает значение константы.
//
// Параметры:
//  ИмяКонстанты	-	Строка.
// 
// Возвращаемое значение:
//   Произвольный	-	значение константы.
//
Функция ЗначениеКонстанты(ИмяКонстанты) Экспорт 
		
	Результат 						= Константы[ИмяКонстанты].Получить();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат("ЗначениеКонстанты." + ИмяКонстанты + "", Результат)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение функциональной опции.
//
// Параметры:
//  ИмяОпции	-	Строка.
//  Параметры	-	Структура.
// 
// Возвращаемое значение:
//   Произвольный	-	значения функциональной опции.
//
Функция ЗначениеФункциональнойОпции(ИмяОпции, Параметры = Неопределено) Экспорт 
			
	Если Параметры = Неопределено Тогда
		Результат 					= ПолучитьФункциональнуюОпцию(ИмяОпции); 		
	Иначе
		Результат 					= ПолучитьФункциональнуюОпцию(ИмяОпции, Параметры);
	КонецЕсли;	
	  	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат("ЗначениеФункциональнойОпции." + ИмяОпции + "", Результат)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает управляемую блокировку.
//
// Параметры:
//  СтруктураПараметров			-	Структура.
//  КоллекцияЗначенийБлокировки	-	Структура
//  							-	Соответствие.
//  КоллекцияОписанияИсточника	-	Структура
//  							-	Соответствие.
//  Отказ						-	Булево.
//  Заголовок					-	Строка.
//
Процедура УстановитьУправляемуюБлокировку(СтруктураПараметров, КоллекцияЗначенийБлокировки = Неопределено, КоллекцияОписанияИсточника = Неопределено, Отказ = Ложь, Заголовок = "") Экспорт

	Если НЕ ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ИспользоватьЗначенияБлокировки = КоллекцияЗначенийБлокировки <> Неопределено
		И (ТипЗнч(КоллекцияЗначенийБлокировки) = Тип("Структура")
			ИЛИ ТипЗнч(КоллекцияЗначенийБлокировки) = Тип("Соответствие"))
		И КоллекцияЗначенийБлокировки.Количество() > 0;

	ИспользоватьИсточникДанных     = КоллекцияОписанияИсточника <> Неопределено
		И (ТипЗнч(КоллекцияОписанияИсточника) = Тип("Структура")
			ИЛИ ТипЗнч(КоллекцияОписанияИсточника) = Тип("Соответствие"))
		И КоллекцияОписанияИсточника.Количество() > 0
		И СтруктураПараметров.Свойство("ИсточникДанных");

	Если НЕ ИспользоватьЗначенияБлокировки И НЕ ИспользоватьИсточникДанных Тогда
		Возврат;
	КонецЕсли;

	Блокировка = Новый БлокировкаДанных;

	ТипТаблицы = ?(СтруктураПараметров.Свойство("ТипТаблицы"), СтруктураПараметров.ТипТаблицы, "РегистрНакопления");
	ИмяТаблицы = СтруктураПараметров.ИмяТаблицы;
	ПространствоБлокировки = ТипТаблицы  + ?(ИмяТаблицы ="","",".")  + ИмяТаблицы;
	ЭлементБлокировки = Блокировка.Добавить(ПространствоБлокировки);

	РежимБлокировки = ?(СтруктураПараметров.Свойство("РежимБлокировки"), СтруктураПараметров.РежимБлокировки, РежимБлокировкиДанных.Исключительный);
	ЭлементБлокировки.Режим = РежимБлокировки;

	Если ИспользоватьЗначенияБлокировки Тогда

		Для каждого ЭлементКоллекции Из КоллекцияЗначенийБлокировки Цикл
			Если ЭлементКоллекции.Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементБлокировки.УстановитьЗначение(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);

		КонецЦикла;

	КонецЕсли;

	Если ИспользоватьИсточникДанных Тогда

		ИсточникДанных = СтруктураПараметров.ИсточникДанных;

		Если ТипЗнч(ИсточникДанных) = Тип("МенеджерВременныхТаблиц") Тогда

			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = ИсточникДанных;
			ТекстЗапроса = "";
			Для каждого ЭлементКоллекции Из КоллекцияОписанияИсточника Цикл
				ТекстЗапроса = ТекстЗапроса + ",
				|	Таб." + ЭлементКоллекции.Значение;
			КонецЦикла;
			ТекстЗапроса = Сред(ТекстЗапроса, 2);
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ"
			+ ТекстЗапроса + "
			|ИЗ
			|	" + СтруктураПараметров.ИмяВременнойТаблицы + " КАК Таб";
			Запрос.Текст = ТекстЗапроса;
			Результат    = Запрос.Выполнить();

			ЭлементБлокировки.ИсточникДанных = Результат;

		Иначе

			ЭлементБлокировки.ИсточникДанных = ИсточникДанных;

		КонецЕсли;

		Для каждого ЭлементКоллекции Из КоллекцияОписанияИсточника Цикл

			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);

		КонецЦикла;

	КонецЕсли;

	Попытка

		Блокировка.Заблокировать();

	Исключение

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСТр("ru = 'Операция не выполнена'"), УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки.Описание);
		ВызватьИсключение НСтр("ru='Операция не выполнена'");

	КонецПопытки;

КонецПроцедуры

// Возвращает банковские реквизиты организации.
// 
// Возвращаемое значение:
//   Структура.
//
Функция БанковскиеРеквизитыОрганизации() Экспорт 
	БанковскиеРеквизиты 	= Новый Структура;
	Запрос  				= Новый Запрос;
	Запрос.Текст 	="ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.ОсновнойБанковскийСчет,
	|	Организации.Наименование КАК НаименованиеОрганизации,
	|	Организации.ИНН КАК ИННОрганизации,
	|	Организации.энргНаименованиеОперацииОплаты
	|ПОМЕСТИТЬ ПерваяОрганизация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БанковскиеСчета.Банк,
	|	ПерваяОрганизация.НаименованиеОрганизации,
	|	ПерваяОрганизация.ИННОрганизации,
	|	БанковскиеСчета.НомерСчета КАК НомерСчетаОрганизации,
	|	ПерваяОрганизация.энргНаименованиеОперацииОплаты
	|ПОМЕСТИТЬ ОсновнойСчет
	|ИЗ
	|	ПерваяОрганизация КАК ПерваяОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО ПерваяОрганизация.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Банки.КоррСчет КАК КоррСчетБанка,
	|	Банки.Код КАК БИКБанка,
	|	ОсновнойСчет.НаименованиеОрганизации,
	|	ОсновнойСчет.ИННОрганизации,
	|	ОсновнойСчет.НомерСчетаОрганизации,
	|	Банки.КоррСчет,
	|	ОсновнойСчет.энргНаименованиеОперацииОплаты КАК НазначениеПлатежа
	|ИЗ
	|	ОсновнойСчет КАК ОсновнойСчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО ОсновнойСчет.Банк = Банки.Ссылка";
	
	Результат 		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Выборка.Следующий();
	
	для Каждого КолонкаРезультат из Результат.Колонки цикл
		 БанковскиеРеквизиты.Вставить(КолонкаРезультат.Имя,Выборка[КолонкаРезультат.Имя]);
	КонецЦикла;
	
	Возврат  БанковскиеРеквизиты;
КонецФункции

// Проверяет наличие присоединенных файлов.
//
// Параметры:
//  ИмяСправочникаХранилищаФайлов	-	Строка.
//  ВладелецФайла					-	СправочникСсылка.
// 
// Возвращаемое значение:
//   Булево.
//
Функция НаличиеПрисоединенныхФайлов(ИмяСправочникаХранилищаФайлов, ВладелецФайла) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Файлы.Ссылка) КАК Ссылка,
	|	Файлы.ВладелецФайла КАК ВладелецФайла
	|ИЗ
	|	&ИмяСправочника КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайлов
	|	И НЕ Файлы.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Файлы.ВладелецФайла";
	
	ПолноеИмяСправочника = "Справочник." + ИмяСправочникаХранилищаФайлов;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяСправочника", ПолноеИмяСправочника);
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ВладелецФайлов", ВладелецФайла);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Устанавливает список маршрутов контролера.
//
// Параметры:
//  Контролер			-	СправочникСсылка.энргСотрудники.
//  МаршрутКонтроллера	-	СправочникСсылка.энргМаршрутыКонтроллеров.
//  Элемент				-	СправочникСсылка.энргМаршрутыКонтроллеров.
//  МКД					-	СправочникСсылка.энргСтроения.
//
Процедура УстановитьСписокМаршрутовКонтролера(Контролер,МаршрутКонтроллера,Элемент, МКД = Неопределено) Экспорт	

	Если ЗначениеЗаполнено(МКД) Тогда
		МаршрутКонтроллера = МКД.МаршрутКонтроллера;
		Если ЗначениеЗаполнено(МаршрутКонтроллера) Тогда
			Контролер = МаршрутКонтроллера.Владелец;
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеМаршруты 	 = ДоступныеМаршруты(Контролер);
	
	Если ДоступныеМаршруты.Количество() = 1 тогда
		МаршрутКонтроллера	= ДоступныеМаршруты[0];		
		Элемент.Вид 		= ВидПоляФормы.ПолеНадписи;
	ИначеЕсли ДоступныеМаршруты.Количество() > 1 тогда
		МаршрутКонтроллера	= Справочники.энргМаршрутыКонтроллеров.ПустаяСсылка();
		Элемент.Вид 		= ВидПоляФормы.ПолеВвода;
		Элемент.РежимВыбораИзСписка = Истина;
		Элемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		Элемент.СписокВыбора.ЗагрузитьЗначения(ДоступныеМаршруты);
	Иначе 
		МаршрутКонтроллера	= Справочники.энргМаршрутыКонтроллеров.ПустаяСсылка();
		Элемент.Вид 		= ВидПоляФормы.ПолеВвода;
		Элемент.РежимВыбораИзСписка = Истина;
		Элемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		Элемент.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает доступность элементов по ролям.
//
// Параметры:
//  Форма				-	ФормаКлиентскогоПриложения.
//  СписокЭлементов		-	Структура.
//  ОбъектМетаданных	-	ОбъектМетаданных: Справочник
//						-	ОбъектМетаданных: Документ
//						-	ОбъектМетаданных: Задачи
//						-	ОбъектМетаданных: РегистрыСведений.
//  Право				-	Строка.
//
Процедура УстановитьДоступностьЭлементовПоРолям(Форма, СписокЭлементов, ОбъектМетаданных, Право = "Изменение") Экспорт 

	Если Не ПравоДоступа(Право, ОбъектМетаданных) Тогда
		Для каждого ТекЭлем Из СписокЭлементов Цикл
			Если ТекЭлем.Ключ = "ЭтаФорма" Тогда
				Форма.ТолькоПросмотр = Истина;
				Продолжить;
			КонецЕсли;
			
			Элемент = Форма.Элементы.Найти(ТекЭлем.Ключ);

			Если Элемент <> Неопределено Тогда
				Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
					Элемент.Доступность    = Ложь;
				Иначе
					Элемент.ТолькоПросмотр = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Создает набор записей с дополнительными параметрами.
//
// Параметры:
//  МенеджерРегистраСведений	-	РегистрыСведенийМенеджер.
// 
// Возвращаемое значение:
//   РегистрСведенийЗапись.
//
Функция СоздатьНаборЗаписейСДополнительнымиПараметрами(МенеджерРегистраСведений) Экспорт 
	
	НаборЗаписей = МенеджерРегистраСведений.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	
	Возврат НаборЗаписей;
	
КонецФункции

// Удаляет повторяющиеся элементы массива.
//
// Параметры:
//  Массив						-	Массив.
//  НеИспользоватьНеопределено	-	Булево.
// 
// Возвращаемое значение:
//   Массив.
//
Функция УдалитьПовторяющиесяЭлементыМассива(Массив, НеИспользоватьНеопределено = Ложь) Экспорт

	ОписаниеТиповСправочники  = Справочники.ТипВсеСсылки();
	ОписаниеТиповДокументы    = Документы.ТипВсеСсылки();
	ОписаниеТиповПВХ          = ПланыВидовХарактеристик.ТипВсеСсылки();
	ОписаниеТиповПланыСчетов  = ПланыСчетов.ТипВсеСсылки();
	ОписаниеТиповПланыРасчета = ПланыВидовРасчета.ТипВсеСсылки();

	Если ТипЗнч(Массив) = Тип("Массив") Тогда

		УжеВМассиве = Новый Соответствие;
		БылоНеопределено = Ложь;

		КолвоЭлементовВМассиве = Массив.Количество();

		Для ОбратныйИндекс = 1 По КолвоЭлементовВМассиве Цикл
			ЭлементМассива = Массив[КолвоЭлементовВМассиве - ОбратныйИндекс];
			ТипЭлемента = ТипЗнч(ЭлементМассива);
			Если ЭлементМассива = Неопределено Тогда
				Если БылоНеопределено или НеИспользоватьНеопределено Тогда
					Массив.Удалить(КолвоЭлементовВМассиве - ОбратныйИндекс);
				Иначе
					БылоНеопределено = Истина;
				КонецЕсли;
				Продолжить;
			ИначеЕсли ОписаниеТиповСправочники.СодержитТип(ТипЭлемента)
				ИЛИ ОписаниеТиповДокументы.СодержитТип(ТипЭлемента)
				ИЛИ ОписаниеТиповПВХ.СодержитТип(ТипЭлемента)
				ИЛИ ОписаниеТиповПланыСчетов.СодержитТип(ТипЭлемента)
				ИЛИ ОписаниеТиповПланыРасчета.СодержитТип(ТипЭлемента) Тогда

				ИДЭлемента = Строка(ЭлементМассива.УникальныйИдентификатор());

			Иначе

				ИДЭлемента = ЭлементМассива;

			КонецЕсли;

			Если УжеВМассиве[ИДЭлемента] = Истина Тогда
				Массив.Удалить(КолвоЭлементовВМассиве - ОбратныйИндекс);
			Иначе
				УжеВМассиве[ИДЭлемента] = Истина;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	Возврат Массив;

КонецФункции

// Возвращает доступные районы.
//
// Параметры:
//  текПользователь	-	СправочникСсылка.Пользователи.
// 
// Возвращаемое значение:
//   ФиксированныйМассив из СправочникСсылка.энргЗоныОтвественности.
//
Функция ДоступныеРайоны(текПользователь)
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь",текПользователь);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргДоступныеРайоны.Район
	|ИЗ
	|	РегистрСведений.энргДоступныеРайоны КАК энргДоступныеРайоны
	|ГДЕ
	|	энргДоступныеРайоны.Пользователь = &Пользователь";
	Результат  	= Запрос.Выполнить();
	Районы  	= Новый Массив;	
	Выборка  	= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		 Районы.Добавить(Выборка.Район);
	КонецЦикла;
	Возврат  Новый ФиксированныйМассив(Районы);
КонецФункции

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура
//            - ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//                       Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля
//                       учитываться не будет.
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то все реквизиты вернутся со 
//                                значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу 
//                                или любой из реквизитов.
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//              Если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//              Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);	
КонецФункции

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура
//            - ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//                       Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля
//                       учитываться не будет.
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то все реквизиты вернутся со 
//                                значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу 
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//              Если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//              Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные = Ложь, КодЯзыка = Неопределено) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные, КодЯзыка);	
КонецФункции

// Получает дату из строки.
//
// Параметры:
//  Стр	-	Строка.
// 
// Возвращаемое значение:
//   Дата.
//
Функция ПолучитьДатуИзСтроки(Стр) Экспорт
	
	ДатаРезультат = Дата("00010101000000");
	
	Если ПустаяСтрока(Стр) Тогда
		Возврат ДатаРезультат;
	КонецЕсли;
	
	Если Найти(Стр,".") > 0 Тогда
		
		Если Найти(Стр,":") > 0 И Найти(Стр," ") > 0 Тогда 
			МассивЧастей = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Стр," ");
			Возврат ПолучитьДатуИзСтроки(МассивЧастей[0]);
		КонецЕсли;
		
		МассивЧастей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,".");
		
	ИначеЕсли Найти(Стр,"/")>0 Тогда
		
		МассивЧастей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"/");
		
	ИначеЕсли Найти(Стр,",")>0 Тогда
		
		МассивЧастей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,",");
		
	ИначеЕсли Найти(Стр,"-")>0 Тогда
		
		МассивЧастей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"-");
		
	КонецЕсли; 
	
	Попытка
		
		Если МассивЧастей.Количество() = 3 Тогда //"01.02.13" или "01.02.2013"
			Год = ?(СтрДлина(МассивЧастей[2]) = 2,2000 + МассивЧастей[2],МассивЧастей[2]);
			ДатаРезультат = Дата(Год,МассивЧастей[1],МассивЧастей[0]);
		ИначеЕсли МассивЧастей.Количество() = 2 Тогда //"02.13" или "02.2013";
			Год = ?(СтрДлина(МассивЧастей[1]) = 2,2000 + МассивЧастей[1],МассивЧастей[1]);
			ДатаРезультат = Дата(Год,МассивЧастей[0],1);
		КонецЕсли;
		
	Исключение
	КонецПопытки; 
	
	Возврат ДатаРезультат; 
	
КонецФункции
 
// Возвращает доступные маршруты.
//
// Параметры:
//  Контролер	- 	СправочникСсылка.энргСотрудники.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргМаршрутыКонтроллеров.
//
Функция ДоступныеМаршруты(Контролер) Экспорт
	
	Результат = Новый Массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргМаршрутыКонтроллеров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.энргМаршрутыКонтроллеров КАК энргМаршрутыКонтроллеров
		|ГДЕ
		|	энргМаршрутыКонтроллеров.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Контролер);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Результат = РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	
	Возврат  Результат;	
	
КонецФункции

// Преобразует JSON в контактную информацию по полям
//
// Параметры:
//  Адрес	-	Строка.
// 
// Возвращаемое значение:
//   Строка.
//
Функция JSONВКонтактнуюИнформациюПоПолям(Адрес) Экспорт
	Попытка
		ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Адрес,
			Перечисления.ТипыКонтактнойИнформации.Адрес);
		Улица =  УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Адрес).street;
	Исключение 
		Улица = "";
	КонецПопытки;
	Возврат Улица;
КонецФункции

// Формирует представление адреса по полям.
//
// Параметры:
//  Значение	-	Строка.
//  МассивПолей	-	Массив из Строк.
// 
// Возвращаемое значение:
//   Строка.
//
Функция СформироватьПредставлениеАдресаПоПолям(Значение, МассивПолей) Экспорт
	СтруктуруАдреса = Новый Структура;
	СтруктуруАдреса.Вставить("Area",			"AreaType");  		// Регион
	СтруктуруАдреса.Вставить("District",		"DistrictType");    // Район
	СтруктуруАдреса.Вставить("city",			"cityType");		// Город
	СтруктуруАдреса.Вставить("CityDistrict",	"CityDistrictType");// Внутригородскойрайон
	СтруктуруАдреса.Вставить("Locality",		"LocalityType");	// Населеный пункт	
	СтруктуруАдреса.Вставить("Territory",		"TerritoryType");	// Территория
	СтруктуруАдреса.Вставить("street",			"streetType");      // Улица
	
	КИПоПолям = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Значение, Перечисления.ТипыКонтактнойИнформации.Адрес);
	Наименование = "";
	
	Для Каждого ТекПоле Из МассивПолей Цикл
		ТекПолеСокр = "";
		Если СтруктуруАдреса.Свойство(ТекПоле, ТекПолеСокр) Тогда
			Наименование = Наименование + ?(ЗначениеЗаполнено(КИПоПолям[ТекПоле]), КИПоПолям[ТекПоле] + " " + КИПоПолям[ТекПолеСокр] + ", ", "");	
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Наименование = Лев(Наименование, СтрДлина(Наименование) - 2);
	КонецЕсли;
	
	
	Возврат Наименование;
КонецФункции

// Очищает поля адреса.
//
// Параметры:
//  Значение	-	Строка.
//  МассивПолей	-	Массив из Строк.
// 
// Возвращаемое значение:
//   Структура	-	см. РаботаСАдресамиКлиентСервер.ОписаниеНовойКонтактнойИнформации.
//
Функция ОчиститьПоляАдреса(Значение, МассивПолей) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Структура") Тогда
		КИПоПолям = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Значение, Перечисления.ТипыКонтактнойИнформации.Адрес);
	Иначе
		КИПоПолям = Значение;
	КонецЕсли;

	СтруктуруАдреса = Новый Структура;
	СтруктуруАдреса.Вставить("Area",			"AreaType");  		// Регион
	СтруктуруАдреса.Вставить("District",		"DistrictType");    // Район
	СтруктуруАдреса.Вставить("city",			"cityType");		// Город
	СтруктуруАдреса.Вставить("CityDistrict",	"CityDistrictType");// Внутригородскойрайон
	СтруктуруАдреса.Вставить("Locality",		"LocalityType");	// Населеный пункт	
	СтруктуруАдреса.Вставить("Territory",		"TerritoryType");	// Территория
	СтруктуруАдреса.Вставить("street",			"streetType");      // Улица
	СтруктуруАдреса.Вставить("HouseNumber",		"houseType"); 	    // Дом 
	СтруктуруАдреса.Вставить("Apartments",		"");				// Квартира
	СтруктуруАдреса.Вставить("Buildings",		"");				// Корпус
	
	Наименование = "";
	
	Для Каждого ТекПоле Из МассивПолей Цикл
		ТекПолеСокр = "";
		Если СтруктуруАдреса.Свойство(ТекПоле, ТекПолеСокр) Тогда
			Если ЗначениеЗаполнено(ТекПолеСокр) Тогда
				КИПоПолям[ТекПоле]		= ""; 
				КИПоПолям[ТекПолеСокр]	= "";
			Иначе
				КИПоПолям[ТекПоле]		= Новый Массив;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(Значение) <> Тип("Структура") Тогда
		Возврат УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(КИПоПолям);
	Иначе
		Возврат КИПоПолям;
	КонецЕсли;
	
КонецФункции

// Возвращает новый массив с заполненными данными.
//
// Параметры:
//  ТаблицаСДанными	-	ТаблицаЗначений.
//  ИменаПолей		-	Строка.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргШкалыПриборовУчета.
//
Функция ВернутьНовыйМассивСЗаполненнымиДанными(ТаблицаСДанными, ИменаПолей) Экспорт
	Массив = новый Массив;
	Если СтрНайти(ИменаПолей, ",") = 0 Тогда
		
		Для Каждого ТекСтрока из ТаблицаСДанными Цикл
			Массив.Добавить(ТекСтрока[ИменаПолей]);
		КонецЦикла;		
		
	Иначе		
		
		Для Каждого ТекСтрока из ТаблицаСДанными Цикл
			НоваяСтрока = Новый Структура(ИменаПолей);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			Массив.Добавить(НоваяСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Массив;	
	
КонецФункции

// Получает количество недопусков для отклонения показаний.
// 
// Возвращаемое значение:
//   Число.
//
Функция ПолучитьКоличествоНедопусковДляОтклоненияПоказаний() Экспорт 	
	КонтантаКолвоНедопусков	= ЗначениеКонстанты("энргКоличествоНедопусковДляОтклоненияПоказаний");
	КолвоНедопусковПодряд	= ?(КонтантаКолвоНедопусков = 0, 99999, КонтантаКолвоНедопусков);
	
	Возврат КолвоНедопусковПодряд;
КонецФункции

// Очищает таблицу по условию.
//
// Параметры:
//  Таблица				-	ДанныеФормыКоллекция.
//  СтруктураУсловия	-	Структура.
//
Процедура ОчиститьТаблицуПоУсловию(Таблица, СтруктураУсловия) Экспорт
	МассивУдаляемыхСтрок = Таблица.НайтиСтроки(СтруктураУсловия);
	УдалитьМассивСтрокИзТаблицы(Таблица, МассивУдаляемыхСтрок);	
КонецПроцедуры

// Удаляет массив строк из таблицы.
//
// Параметры:
//  Таблица					-	ДанныеФормыКоллекция.
//  МассивУдаляемыхСтрок	-	Массив из ДанныеФормыЭлементКоллекции.
//
Процедура УдалитьМассивСтрокИзТаблицы(Таблица, МассивУдаляемыхСтрок) Экспорт
	Для Каждого СтрокаУдаления из МассивУдаляемыхСтрок Цикл
		Таблица.Удалить(СтрокаУдаления);
	КонецЦикла;
КонецПроцедуры

// Очищает данные показаний по точке учета.
//
// Параметры:
//  ИдентификаторСтроки	-	УникальныйИдентификатор.
//  ТаблицаТочек		-	ДанныеФормыКоллекция.
//  ТаблицаШкал			-	ДанныеФормыКоллекция.
//  ТаблицаПоказаний	-	ДанныеФормыКоллекция.
//
Процедура ОчиститьДанныеПоказанийПоТочкеУчета(ИдентификаторСтроки, ТаблицаТочек, ТаблицаШкал, ТаблицаПоказаний) Экспорт
	СтрокаТочкиУчета = ТаблицаТочек.НайтиСтроки(Новый Структура("IDСтроки", ИдентификаторСтроки));
	Для Каждого ТекСтрокаТочки из СтрокаТочкиУчета Цикл 
		СтрокиШкал = ТаблицаШкал.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрокаТочки.IDСтроки));
		Для Каждого ТекСтрокаШкалы из СтрокиШкал Цикл
			ОчиститьТаблицуПоУсловию(ТаблицаПоказаний, Новый Структура("IDСтроки", ТекСтрокаШкалы.IDСтроки));
		КонецЦикла;
		УдалитьМассивСтрокИзТаблицы(ТаблицаШкал, СтрокиШкал);
	КонецЦикла;
	УдалитьМассивСтрокИзТаблицы(ТаблицаТочек, СтрокаТочкиУчета);
КонецПроцедуры

// Удаляет временные файлы
//
// Параметры:
//  ВременныеФайлы	-	Массив из Строк.
//
Процедура УдалитьВременныеФайлы(ВременныеФайлы) Экспорт
	Для Каждого ТекАдресВрменногоХранилища из ВременныеФайлы Цикл
		УдалитьИзВременногоХранилища(ТекАдресВрменногоХранилища);
	КонецЦикла;	
КонецПроцедуры

// Удаляет файлы по указанному пути.
//
// Параметры:
//  ВременныеФайлы	-	Массив из Строк.
//
Процедура УдалитьФайлыПоПути(ВременныеФайлы) Экспорт
	Для Каждого ПутьФайла из ВременныеФайлы Цикл
		УдалитьФайлы(ПутьФайла);
	КонецЦикла;	
КонецПроцедуры

// Дополняет список значений.
//
// Параметры:
//  СписокРезультат	-	СписокЗначений.
//  СписокИсточник	-	СписокЗначений, Массив.
//
Процедура ДополнитьСписокЗначений(СписокРезультат, СписокИсточник) Экспорт  
	
	Если ТипЗнч(СписокИсточник) = Тип("СписокЗначений") Тогда
		 ДополнитьСписокЗначенийИзСпискаЗначений(СписокРезультат, СписокИсточник)
	 ИначеЕсли ТипЗнч(СписокИсточник) = Тип("Массив") Тогда
		 ДополнитьСписокЗначенийИзМассива(СписокРезультат, СписокИсточник)
	 КонецЕсли;
	 
КонецПроцедуры

// Дополняет список значений из списка значений.
//
// Параметры:
//  СписокРезультат	 - 	СписокЗначений.
//  СписокИсточник	 - 	СписокЗначений.
//
Процедура ДополнитьСписокЗначенийИзСпискаЗначений(СписокРезультат, СписокИсточник) Экспорт  
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл
		СписокРезультат.Добавить(
			ЭлементСписка.Значение, 
			ЭлементСписка.Представление, 
			ЭлементСписка.Пометка, 
			ЭлементСписка.Картинка);
	КонецЦикла;
	
КонецПроцедуры

// Дополняет список значений из массива.
//
// Параметры:
//  СписокРезультат	-	СписокЗначений
//  СписокИсточник	-	Массив.
//
Процедура ДополнитьСписокЗначенийИзМассива(СписокРезультат, СписокИсточник) Экспорт  
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл
		СписокРезультат.Добавить(ЭлементСписка);
	КонецЦикла;
	
КонецПроцедуры

// Обновляет адрес коллекция.
//
// Параметры:
//  ОбъектыФормы		 - 	ДанныеФормыСтруктура.
//  ИмяКоллекции		 - 	Строка.
//  ТолькоПустыеАдреса	 - 	Булево.
//
Процедура ОбновитьАдресКоллекция(ОбъектыФормы, ИмяКоллекции, ТолькоПустыеАдреса) Экспорт 
	
	ДанныеТабЧасти 					= Новый ТаблицаЗначений;
	ДанныеТабЧасти.Колонки.Добавить("ИдентификаторСтроки",Новый ОписаниеТипов("Число"));
	ДанныеТабЧасти.Колонки.Добавить("Абонент",Новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
	
	Для Каждого СтрокаТабЧасти Из ОбъектыФормы[ИмяКоллекции] Цикл
		Если ТолькоПустыеАдреса И НЕ ПустаяСтрока(СтрокаТабЧасти.Адрес) Тогда
			Продолжить;
		КонецЕсли; 		
		
		Строка 						= ДанныеТабЧасти.Добавить();
		Строка.Абонент 				= СтрокаТабЧасти.Абонент;
		Строка.ИдентификаторСтроки  = СтрокаТабЧасти.ПолучитьИдентификатор();		
	КонецЦикла;
	
	Текст 							=
	"ВЫБРАТЬ
	|	ДанныеТабЧасти.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДанныеТабЧасти.Абонент КАК Абонент
	|ПОМЕСТИТЬ ДанныеТабЧасти
	|ИЗ
	|	&ДанныеТабЧасти КАК ДанныеТабЧасти
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТабЧасти.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	энргАбонентыКонтактнаяИнформация.Представление КАК Адрес
	|ИЗ
	|	ДанныеТабЧасти КАК ДанныеТабЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|		ПО ДанныеТабЧасти.Абонент = энргАбонентыКонтактнаяИнформация.Ссылка
	|			И (энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъекта))";
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ДанныеТабЧасти"		, ДанныеТабЧасти);	
	Результат 						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		 Строка  					= ОбъектыФормы[ИмяКоллекции].НайтиПоИдентификатору(Выборка.ИдентификаторСтроки);
		 Строка.Адрес 				= Выборка.Адрес;
	КонецЦикла;
	
КонецПроцедуры

// Получает первые цифры строки.
//
// Параметры:
//  ВходнаяСтрока	-	Строка.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьСтрокуТолькоПервыеЦифры(ЗНАЧ ВходнаяСтрока)Экспорт 
	
	РезультатТолькоПервыеЦифры = ""; 
	ИндексЭлемента = 1; 
	ДоступныеСимволы = "0123456789"; 
	
	Пока ИндексЭлемента <= СтрДлина(ВходнаяСтрока) Цикл
		
		ПроверяемыйСимвол = Сред(ВходнаяСтрока, ИндексЭлемента, 1); 
		
		Если СтрНайти(ДоступныеСимволы, ПроверяемыйСимвол) = 0 Тогда 
			Если ЗначениеЗаполнено(РезультатТолькоПервыеЦифры) Тогда Прервать; КонецЕсли; 
			ВходнаяСтрока = СтрЗаменить(ВходнаяСтрока, ПроверяемыйСимвол, ""); 
			Продолжить; 
		Иначе 
			РезультатТолькоПервыеЦифры = РезультатТолькоПервыеЦифры + ПроверяемыйСимвол; 
		КонецЕсли; 
		
		ИндексЭлемента = ИндексЭлемента + 1; 
		
	КонецЦикла; 
	
	Возврат РезультатТолькоПервыеЦифры; 
	
КонецФункции

// Получает склонения объекта.
//
// Параметры:
//  ОбъектСклонения	-	ОпределяемыйТип.ОбъектСклонения.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьСклоненияОбъекта(ОбъектСклонения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СклоненияПредставленийОбъектов.ИменительныйПадеж КАК ИменительныйПадеж,
		|	СклоненияПредставленийОбъектов.РодительныйПадеж КАК РодительныйПадеж,
		|	СклоненияПредставленийОбъектов.ДательныйПадеж КАК ДательныйПадеж,
		|	СклоненияПредставленийОбъектов.ВинительныйПадеж КАК ВинительныйПадеж,
		|	СклоненияПредставленийОбъектов.ТворительныйПадеж КАК ТворительныйПадеж,
		|	СклоненияПредставленийОбъектов.ПредложныйПадеж КАК ПредложныйПадеж
		|ИЗ
		|	РегистрСведений.СклоненияПредставленийОбъектов КАК СклоненияПредставленийОбъектов
		|ГДЕ
		|	СклоненияПредставленийОбъектов.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", ОбъектСклонения);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#Область Макросы

// Выполняет макрос.
//
// Параметры:
//  Объект				-	СправочникСсылка.макрМакросы.
//  НаименованиеМакроса	-	Строка.
//  ИсполняемыйКод		-	Строка.
//  МакросТаблица		-	Булево.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ВыполнитьМакрос(Объект, НаименованиеМакроса, ИсполняемыйКод, МакросТаблица = Ложь) Экспорт
	
	Результат="";
	
	Попытка 
		Выполнить(ИсполняемыйКод);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Некорректно настроен макрос: " + НаименованиеМакроса;
		Сообщение.Сообщить();
		Возврат NULL;
	КонецПопытки;
	Если МакросТаблица Тогда
		Возврат Результат;
	Иначе
		Возврат Строка(Результат);
	КонецЕсли;
		
КонецФункции

// Получает печатную форму.
//
// Параметры:
//  Ссылка	-	СправочникСсылка.макрПечатныеФормы.
// 
// Возвращаемое значение:
//   ХранилищеЗначения.
//
Функция ПолучитьПечатнуюФорму(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	макрПечатныеФормы.ПечатнаяФорма
	|ИЗ
	|	Справочник.макрПечатныеФормы КАК макрПечатныеФормы
	|ГДЕ
	|	макрПечатныеФормы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПечатнаяФорма = Выборка.ПечатнаяФорма; 
		Если ТипЗнч(ПечатнаяФорма) = Тип("ХранилищеЗначения") Тогда
			Возврат ПечатнаяФорма.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает макросы объекта.
//
// Параметры:
//  ОбъектСсылка	-	СправочникСсылка.макрМакросы.
// 
// Возвращаемое значение:
//   Массив из Структура.
//
Функция ПолучитьМакросыОбъекта(ОбъектВладелец=Неопределено) Экспорт
	
	МакросыИКоды = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	макрМакросыВладельцыМакроса.Ссылка КАК МакросСсылка,
	               |	макрМакросыВладельцыМакроса.Ссылка.Наименование КАК МакросНаименование
	               |ПОМЕСТИТЬ ВТ_МакросыВладельца
	               |ИЗ
	               |	Справочник.макрМакросы.ВладельцыМакроса КАК макрМакросыВладельцыМакроса
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(макрМакросыВладельцыМакроса.ОбъектВладелец.СсылкаНаОбъект) = ТИПЗНАЧЕНИЯ(&ОбъектВладелец)
	               |	И НЕ макрМакросыВладельцыМакроса.Ссылка.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	макрМакросы.Ссылка,
	               |	макрМакросы.Наименование
	               |ИЗ
	               |	Справочник.макрМакросы КАК макрМакросы
	               |ГДЕ
	               |	макрМакросы.ВсеОбъекты
	               |	И НЕ макрМакросы.ПометкаУдаления
	               |;
	               |
	               |
	               |ВЫБРАТЬ
	               |	макрКодыМакросов.ИсполняемыйКод,
	               |	ВТ_МакросыВладельца.МакросСсылка,
	               |	ВТ_МакросыВладельца.МакросНаименование
	               |ИЗ
	               |	РегистрСведений.макрКодыМакросов КАК макрКодыМакросов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МакросыВладельца КАК ВТ_МакросыВладельца
	               |		ПО макрКодыМакросов.Макрос = ВТ_МакросыВладельца.МакросСсылка";
	Запрос.УстановитьПараметр("ОбъектВладелец", ОбъектВладелец);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл;
		СтруктураЗначений = Новый Структура;
		СтруктураЗначений.Вставить("МакросСсылка",   Выборка.МакросСсылка);
		СтруктураЗначений.Вставить("ИсполняемыйКод", Выборка.ИсполняемыйКод);
		СтруктураЗначений.Вставить("МакросНаименование",   Выборка.МакросНаименование);
		МакросыИКоды.Добавить(СтруктураЗначений);
	КонецЦикла;
	
	Возврат МакросыИКоды;
	
КонецФункции

Процедура ПолучитьЗначенияРеквизитов(Класс = "Справочник", Ссылка, Соответствие) Экспорт 
	
	ИмяОбъектаМетаданных = Ссылка.Метаданные().Имя; 
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ";
	Для Каждого КлючИЗначение Из Соответствие Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ИмяОбъектаМетаданных + "." + КлючИЗначение.Ключ + " КАК " + СтрЗаменить(КлючИЗначение.Ключ, ".", "_1_") + ",";
	КонецЦикла;
	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-1);
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ИЗ";
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + Класс + "." + ИмяОбъектаМетаданных + " КАК " + ИмяОбъектаМетаданных;
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + " ГДЕ ";
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ИмяОбъектаМетаданных + ".Ссылка = &Ссылка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Возврат;
	КонецПопытки;

	Если Выборка.Следующий() Тогда
		Для Каждого КлючИЗначение Из Соответствие Цикл
			Соответствие[КлючИЗначение.Ключ] = Выборка[СтрЗаменить(КлючИЗначение.Ключ, ".", "_1_")];
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

// Заменяет макросы печати.
//
// Параметры:
//  ОбъектСсылка	-	СправочникСсылка.макрМакросы.
//  ПутьКФайлу		-	Строка.
//
Процедура ЗаменитьМакросыПечати(ОбъектСсылка, ПутьКФайлу) экспорт
	COMОбъект = ПолучитьCOMОбъект(ПутьКФайлу);	
	COMДокумент = COMОбъект.Application.Documents(1);
	МакросыОбъекта = энргОбщегоНазначения.ПолучитьМакросыОбъекта(ОбъектСсылка);
	МассивЗакладки= Новый Массив;
	Если COMДокумент.Bookmarks.Count >= 1 Тогда   
		Для инд=1 по COMДокумент.Bookmarks.Count Цикл
			МассивЗакладки.Добавить(COMДокумент.Bookmarks(инд).Name);
		КонецЦикла;
	КонецЕсли;
	Для Каждого Стр Из МакросыОбъекта Цикл
		Если энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"ВерхнийКолонтитул") Тогда
			Замена = COMДокумент.Sections(1).Headers(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НомерВерхнегоКолонтитула")).Range;
		ИначеЕсли энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НижнийКолонтитул") Тогда
			Замена = COMДокумент.Sections(1).Footers(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НомерНижнегоКолонтитула")).Range;
		Иначе
			Замена = COMДокумент.Content;
		КонецЕсли;
		Если энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"ИскатьВТаблицах") и энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НомерТаблицы") <> 0 Тогда
			Замена = Замена.Tables(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НомерТаблицы")).Range;
		КонецЕсли;
		Замена = Замена.Find;
		Результат = энргОбщегоНазначения.ВыполнитьМакрос(ОбъектСсылка, Стр.МакросНаименование, Стр.ИсполняемыйКод, Ложь);
		
		Если Результат = NULL Тогда Продолжить; КонецЕсли;
		
		МаксДлина = 255;proceed="§§§";
		
		Если СтрДлина(Результат)<МаксДлина Тогда
			Замена.Execute(Стр.МакросНаименование, Ложь, Истина, Ложь, , , Истина, , Ложь, Результат,2);
		Иначе
			МассивСтрок = Новый Массив; Инд=0;
			Пока СтрДлина(Результат)>МаксДлина Цикл
				РазбитаяСтрока = Лев(Результат, МаксДлина-3);
				ПоследнийСимвол = Прав(РазбитаяСтрока, 1);
				Если ПоследнийСимвол = "^" Тогда
					МассивСтрок.Добавить(Лев(Результат, МаксДлина-4));
					Результат = Сред(Результат, СтрДлина(МассивСтрок[Инд]+1));
				Иначе
					МассивСтрок.Добавить(Лев(Результат, МаксДлина-3));
					Результат = Сред(Результат, СтрДлина(МассивСтрок[Инд]+1));
				КонецЕсли;				
				Инд = Инд + 1;
			КонецЦикла;
			Если СтрДлина(Результат)>0 Тогда МассивСтрок.Добавить(Результат); КонецЕсли;
			Для Инд=0 По МассивСтрок.Количество()-2 Цикл 
				МассивСтрок[Инд]=МассивСтрок[Инд]+proceed; 
			КонецЦикла;
			Замена.Execute(Стр.МакросНаименование, Ложь, Истина, Ложь, , , Истина, , Ложь, МассивСтрок[0],2);
			Для Инд=1 По МассивСтрок.Количество()-1 Цикл
				Замена.Execute(proceed, Ложь, Истина, Ложь, , , Истина, , Ложь, МассивСтрок[Инд],2);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ИмяЗакладки из МассивЗакладки Цикл
		СтруктураМакроса =  энргОбщегоНазначения.ПолучитьКодМакросаПоЗакладке(ИмяЗакладки, ОбъектСсылка);
		Результат = энргОбщегоНазначения.ВыполнитьМакрос(ОбъектСсылка, ИмяЗакладки, СтруктураМакроса.ИсполняемыйКод, Истина);
		
		COMДокумент.Bookmarks(ИмяЗакладки).Select();
		
		Табл= COMДокумент.Application.Selection.Range;
		СтрокаТаблицы = "";
		Для каждого стр из Результат Цикл
			Для каждого КолонкаТЗ из стр Цикл
				СтрокаТаблицы = СтрокаТаблицы + КолонкаТЗ + "*";
			КонецЦикла;
			Табл.InsertAfter(Лев(СтрокаТаблицы, СтрДлина(СтрокаТаблицы) - 1));
			Табл.InsertParagraphAfter();
			СтрокаТаблицы = "";
		КонецЦикла;
		
		Табл.ConvertToTable("*");
		НомерФормируемойТаблицы =	COMДокумент.Range(0, Табл.Tables(1).Range.End).Tables.Count;
		COMДокумент.Tables(НомерФормируемойТаблицы).AutoFormat(16);
	КонецЦикла;
КонецПроцедуры

// Получает код макроса по закладке.
//
// Параметры:
//  ИмяЗакладки		-	Строка.
//  ОбъектСсылка	-	СправочникСсылка.макрМакросы.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ПолучитьКодМакросаПоЗакладке(ИмяЗакладки, ОбъектСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	макрМакросыВладельцыМакроса.Ссылка КАК МакросСсылка
	|ПОМЕСТИТЬ ВТ_МакросыВладельца
	|ИЗ
	|	Справочник.макрМакросы.ВладельцыМакроса КАК макрМакросыВладельцыМакроса
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(макрМакросыВладельцыМакроса.ОбъектВладелец.СсылкаНаОбъект) = ТИПЗНАЧЕНИЯ(&ОбъектВладелец)
	|	И НЕ макрМакросыВладельцыМакроса.Ссылка.ПометкаУдаления
	|	И макрМакросыВладельцыМакроса.Ссылка.Наименование = &Наименование
	|	И макрМакросыВладельцыМакроса.Ссылка.ФормированиеТаблицы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	макрМакросы.Ссылка
	|ИЗ
	|	Справочник.макрМакросы КАК макрМакросы
	|ГДЕ
	|	макрМакросы.ВсеОбъекты
	|	И НЕ макрМакросы.ПометкаУдаления
	|	И макрМакросы.Наименование = &Наименование
	|	И макрМакросы.ФормированиеТаблицы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	макрКодыМакросов.ИсполняемыйКод КАК ИсполняемыйКод,
	|	макрКодыМакросов.Макрос.НомерФормируемойТаблицы КАК НомерФормируемойТаблицы
	|ИЗ
	|	РегистрСведений.макрКодыМакросов КАК макрКодыМакросов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МакросыВладельца КАК ВТ_МакросыВладельца
	|		ПО макрКодыМакросов.Макрос = ВТ_МакросыВладельца.МакросСсылка";
	
	Запрос.УстановитьПараметр("Наименование", ИмяЗакладки);
	Запрос.УстановитьПараметр("ОбъектВладелец", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВозвратСтр = Новый Структура;
		ВозвратСтр.Вставить("ИсполняемыйКод", ВыборкаДетальныеЗаписи.ИсполняемыйКод); 
		ВозвратСтр.Вставить("НомерФормируемойТаблицы", ВыборкаДетальныеЗаписи.НомерФормируемойТаблицы);
		Возврат ВозвратСтр;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// Получает описание свойств регистра.
//
// Параметры:
//  ОбъектМетаданных	-	ОбъектМетаданных: РегистрНакопления, ОбъектМетаданных: РегистрСведений.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ПолучитьОписаниеСвойствРегистра(ОбъектМетаданных) Экспорт 
	ОписаниеОбъекта 	= Новый Структура();
		
	ОписаниеКоллекции(ОписаниеОбъекта, ОбъектМетаданных.Измерения);
	ОписаниеКоллекции(ОписаниеОбъекта, ОбъектМетаданных.Ресурсы);
	ОписаниеКоллекции(ОписаниеОбъекта, ОбъектМетаданных.Реквизиты);
	
	Возврат ОписаниеОбъекта;
КонецФункции

Функция ОписаниеКоллекции(ОписаниеОбъекта, Коллекция)
	Для Каждого ТекСвойство из Коллекция Цикл
		ОписаниеОбъекта.Вставить(ТекСвойство.Имя);
	КонецЦикла;
КонецФункции

#КонецОбласти

#Область ПретензионноИсковаяРабота

#Область РаботаСДаннымиПИР

// Получает пользователей с отбором по ролям.
//
// Параметры:
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  Роли		-	СправочникСсылка.энргРоли.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьПользователейСОтборомПоРолям(Организация, Район, Роли) Экспорт
	Схема							= Неопределено;
	Параметры 						= Новый Структура;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыОтбора					= Новый Массив;
	
	ОтборПоРолям 		= энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("Роль", "Роли"));
	ОтборПоОрганизации 	= энргФормированиеТекстовЗапроса.ПараметрПериодРавно(Новый Структура("Организация", "Организация"));
	ОтборПоРайону 		= энргФормированиеТекстовЗапроса.ПараметрПериодРавно(Новый Структура("Район", "Район"));

	ПараметрыВТ.Добавить(ОтборПоРолям);	
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	РегистрыСведений.энргРолиПользователей.РолиПользователей(Схема, Параметры);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Роли", 			Роли);
	ПараметрыЗапроса.Вставить("Организация", 	Организация);
	ПараметрыЗапроса.Вставить("Район", 			Район);
		
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);;	
КонецФункции

// Получает актуальный статус события.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  ДокРегистратор	-	ДокументСсылка.энргСобытие.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьАктуальныйСтатусСобытия(Период, Организация, Район, ДокРегистратор) Экспорт
	Схема							= Неопределено;
	Параметры 						= Новый Структура;
	ПараметрыВТ 					= Новый Массив;
		
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация"		, "Организация")));	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район"			, "Район")));	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("ДокРегистратор"	, "ДокРегистратор")));
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	РегистрыСведений.энргСтатусСогласованияСобытий.СтатусСогласованияСобытий(Схема, Параметры);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"			, Период);
	ПараметрыЗапроса.Вставить("Организация"		, Организация); 	
	ПараметрыЗапроса.Вставить("Район"			, Район);
	ПараметрыЗапроса.Вставить("ДокРегистратор"	, ДокРегистратор);
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);;	
КонецФункции

// Получает актуальный статус выполнения события.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  ДокРегистратор	-	ДокументСсылка.энргСобытие.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьАктуальныйСтатусВыполненияСобытия(Период, Организация, Район, ДокРегистратор) Экспорт
	Схема							= Неопределено;
	Параметры 						= Новый Структура;
	ПараметрыВТ 					= Новый Массив;
		
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация"		, "Организация")));	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район"			, "Район")));	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("ДокРегистратор"	, "ДокРегистратор")));
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	РегистрыСведений.энргСтатусВыполненияСобытий.СтатусВыполненияСобытий(Схема, Параметры);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"			, Период);
	ПараметрыЗапроса.Вставить("Организация"		, Организация); 	
	ПараметрыЗапроса.Вставить("Район"			, Район);
	ПараметрыЗапроса.Вставить("ДокРегистратор"	, ДокРегистратор);
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);;	
КонецФункции

#КонецОбласти

#Область РаботаСФормамиПИР

// Получаеть формы ПИР для отображения как строка.
// 
// Возвращаемое значение:
//   Структура:
//    * ФормаДокумента	-	Строка.
//    * ФормаСписка		-	Строка.
//
Функция ПолучитьФормыПИРДляОтображенияКакСтрока() Экспорт
	Возврат Обработки.энргСобытиеМенеджерФорм.ПолучитьФормыДляОтображенияКакСтрока();
КонецФункции

#КонецОбласти

#КонецОбласти

#Область РегистрацияОшибок

// Возвращает необязательные параметры для регистации ошибки.
// 
// Возвращаемое значение:
//   Структура.
//
Функция НеобязательныеПараметрыРегистацииОшибки() Экспорт 
	Результат = Новый Структура;
	Результат.Вставить("ОбъектМетаданных");
	Результат.Вставить("Данные");
	Результат.Вставить("ВыводитьСообщениеПользователю");
	Результат.Вставить("ТекстПользователю");
	
	Возврат Результат;
КонецФункции

// Регистрирует ошибку.
//
// Параметры:
//  ИмяСобытия				-	Строка.
//  Уровень					-	УровеньЖурналаРегистрации.
//  Комментарий				-	Строка.
//  НеобязательныеПараметры	-	Структура	-	см. энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки.
//
Процедура ЗарегистрироватьОшибку(ИмяСобытия, Уровень, Комментарий, НеобязательныеПараметры = Неопределено) Экспорт
	ОбъектМетаданных 				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НеобязательныеПараметры, "ОбъектМетаданных", Неопределено);
	Данные 							= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НеобязательныеПараметры, "Данные", Неопределено);
	ВыводитьСообщениеПользователю 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НеобязательныеПараметры, "ВыводитьСообщениеПользователю", Истина);
	ТекстПользователю 				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НеобязательныеПараметры, "ТекстПользователю", Неопределено);
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных , Данные, Комментарий);
	Если ВыводитьСообщениеПользователю Тогда
		Если ТекстПользователю = Неопределено Тогда 
			ТекстПользователю = Комментарий;
		КонецЕсли;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий);
	КонецЕсли;	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСИнтеграциейОФД

// Существует ли подсистема интеграция ОФД.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ПодсистемаИнтеграцияОФДСуществует() Экспорт 
	Возврат ОбщегоНазначения.ПодсистемаСуществует("фискИнтеграцияОФД");
КонецФункции

// Возвращает модуль общего назначения интеграции ОФД.
// 
// Возвращаемое значение:
//   ОбщийМодуль.
//
Функция МодульОбщегоНазначенияИнтеграцииОФД() Экспорт
	Возврат ОбщегоНазначения.ОбщийМодуль("фискОбщегоНазначения");
КонецФункции
	
#КонецОбласти

#Область РаботаСJSON

// Возвращает результат сериализации в JSON.
//
// Параметры:
//  ОбъектСериализации	-	Произвольный.
// 
// Возвращаемое значение:
//   Строка.
//
Функция СериализоватьВJSON(ОбъектСериализации) Экспорт 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ОбъектСериализации);
	Результат = ЗаписьJSON.Закрыть();;
	
	Возврат Результат;
КонецФункции

// Возвращает результат десериализации JSON.
//
// Параметры:
//  ТекстJSON	-	Строка.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ДесериализоватьJSON(ТекстJSON) Экспорт 
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
КонецФункции
	
#КонецОбласти

// Возвращает новое уникальное имя файла DBF.
// 
// Возвращаемое значение:
//   Строка.
//
Функция НовоеУникальноеИмяФайлаDBF() Экспорт
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло 	= Формат(ГСЧ.СлучайноеЧисло(10000, 99999), "ЧГ=0");
	Результат 		= "v8_" + СлучайноеЧисло;
	Возврат Результат;
КонецФункции

#КонецОбласти
